[
    {
        "title": "Pre-Event Webinar 1: Optimize Your Resume",
        "description": "Brighten up your resume with key tips & tricks from Mr. Patrick Tan.",
        "content": "Are you ready to stand out among the crowd? Join us for the first pre-event webinar, <b>\"Optimize Your Resume,\"</b> where Mr. Patrick Tan, a renowned career consultant with over a decade of experience, will share invaluable tips and tricks to craft a winning resume.<br><br>Learn how to highlight your strengths, tailor your resume for specific roles, and impress recruiters with a professional touch. This webinar is a must-attend for anyone looking to enhance their job prospects and secure their dream job or internship.<br><br><b>📅 Date:</b> December 15, 2024<br><b>🕒 Time:</b> 3:00 PM - 4:30 PM<br><b>📍 Location:</b> WebEx <br><br>Seats are limited, so don't miss out on this exclusive opportunity to gain insider knowledge and take your resume to the next level!",
        "image": "premium_photo-1661767467261-4a4bed92a507.jpeg",
        "badgeText": "Event"
    },
    {
        "title": "Pre-Event Webinar 2: Ace Your Interview",
        "description": "Nervous for your interview? No worries! Mr. Willian Lim got you covered!",
        "content": "Are you nervous about interviews? Join us for the second pre-event webinar, <b>Ace Your Interview,</b> where Mr. William Lim, an experienced HR professional, will share proven strategies to excel in interviews. Learn how to confidently answer challenging questions, present yourself professionally, and leave a lasting impression on recruiters.<br><br> This webinar is designed for anyone looking to boost their interview skills and stand out to potential employers.<br><br> <b>📅 Date:</b> December 16, 2024<b> <br>🕒 Time:</b> 3:00 PM - 4:30 PM<b><br>📍 Location:</b> Dewan Utama Pelajar, Universiti Sains Malaysia<br><br> Seats are limited, so don’t miss this valuable opportunity to elevate your career and land your dream job or internship!",
        "image": "1520083176564.jpeg",
        "badgeText": "Event"
    },
    {
        "title": "Internship @ Vitrox",
        "description": "Considering an internship at Vitrox? Let's listen to what your peers has to say!",
        "content": "Considering an internship at Vitrox? Let’s dive into the real stories behind one of Malaysia’s most sought-after companies for young tech talent.<br><br>Vitrox Corporation has made a name for itself as a global leader in machine vision solutions, advanced manufacturing technology, and automation. But behind the innovative systems and cutting-edge products lies an inspiring ecosystem dedicated to nurturing young talent. Through their internship program, Vitrox offers students a once-in-a-lifetime opportunity to work alongside industry experts on projects that redefine the boundaries of technology.<br><br>In this article, we explore the journey of interns at Vitrox. Many interns describe the program as transformative—one where they develop technical expertise while working on high-stakes industry projects. From building machine learning models to analyzing real-world production challenges, interns gain invaluable exposure to how the industry operates at the cutting edge. The support of mentors and collaborative work culture ensures that interns never feel out of their depth.<br><br>But it’s not just about work. Vitrox places a strong emphasis on personal and professional development. Weekly workshops, peer mentoring sessions, and networking opportunities with senior executives are built into the internship program. This holistic approach ensures that every intern emerges with a well-rounded perspective, ready to take on the challenges of the industry.<br><br>In addition, interns often cite Vitrox's commitment to social responsibility as a source of pride. The company’s involvement in green initiatives and community outreach programs shows that it doesn’t just focus on technology—it strives to create a better future for everyone.<br><br>For students aspiring to enter the tech field, an internship at Vitrox is more than a line on their resume—it’s a launching pad for a fulfilling career. Whether you’re an engineering enthusiast, a coding whiz, or a data science prodigy, Vitrox provides the tools, mentorship, and projects to help you achieve your goals.",
        "image": "_D4A4282-Pano.jpg",
        "badgeText": "Intern"
    },
    {
        "title": "Introduction to Jabil",
        "description": "Get to know what Jabil does here!",
        "content": "Jabil is more than just a global manufacturing powerhouse—it’s a hub of innovation, collaboration, and growth. For decades, Jabil has been at the forefront of delivering cutting-edge solutions in electronics manufacturing, supply chain management, and advanced technologies. But what makes Jabil unique is the extraordinary environment it has created for its employees, where ideas thrive and careers are built.<br><br>This newsletter takes you inside Jabil, offering a glimpse into its dynamic culture and the exciting opportunities it provides for students and professionals alike. At Jabil, employees work on solutions that power some of the world’s most well-known brands. From designing state-of-the-art electronics to optimizing supply chain operations, the work at Jabil spans multiple disciplines and industries.<br><br>One of Jabil’s standout features is its commitment to sustainability and innovation. By leveraging its global presence, the company focuses on reducing waste, creating eco-friendly solutions, and fostering a culture of environmental stewardship. Employees are encouraged to take ownership of projects that align with their passions, making every day at Jabil an opportunity to make a meaningful impact.<br><br>Through Jabil’s internship programs, students get a hands-on experience like no other. Interns are immersed in real-world projects, tackling challenges that push the boundaries of technology and creativity. Jabil doesn’t just train interns; it empowers them to lead. The program emphasizes learning by doing, ensuring that interns walk away with skills that prepare them for the fast-paced world of advanced manufacturing and technology.<br><br>But Jabil isn’t just about work. The company believes in giving back to the community and promoting employee well-being. From team-building activities to health and wellness initiatives, Jabil ensures that every team member feels valued and supported.<br><br>Whether you’re a student exploring career paths or a seasoned professional looking for your next big challenge, Jabil offers a platform to grow, innovate, and leave a lasting mark on the world.",
        "image": "How-to-Guide-Students-on-Virtual-Internship-Programs.jpg",
        "badgeText": "Company"
    }
  ]  